// Generated by jextract

package audio.fmod.panama;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct FMOD_TAG {
 *     FMOD_TAGTYPE type;
 *     FMOD_TAGDATATYPE datatype;
 *     char *name;
 *     void *data;
 *     unsigned int datalen;
 *     FMOD_BOOL updated;
 * }
 * }
 */
public class FMOD_TAG {

    FMOD_TAG() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        FmodCore.C_INT.withName("type"),
        FmodCore.C_INT.withName("datatype"),
        FmodCore.C_POINTER.withName("name"),
        FmodCore.C_POINTER.withName("data"),
        FmodCore.C_INT.withName("datalen"),
        FmodCore.C_INT.withName("updated")
    ).withName("FMOD_TAG");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * FMOD_TAGTYPE type
     * }
     */
    public static final OfInt type$layout() {
        return type$LAYOUT;
    }

    private static final long type$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * FMOD_TAGTYPE type
     * }
     */
    public static final long type$offset() {
        return type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * FMOD_TAGTYPE type
     * }
     */
    public static int type(MemorySegment struct) {
        return struct.get(type$LAYOUT, type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * FMOD_TAGTYPE type
     * }
     */
    public static void type(MemorySegment struct, int fieldValue) {
        struct.set(type$LAYOUT, type$OFFSET, fieldValue);
    }

    private static final OfInt datatype$LAYOUT = (OfInt)$LAYOUT.select(groupElement("datatype"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * FMOD_TAGDATATYPE datatype
     * }
     */
    public static final OfInt datatype$layout() {
        return datatype$LAYOUT;
    }

    private static final long datatype$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * FMOD_TAGDATATYPE datatype
     * }
     */
    public static final long datatype$offset() {
        return datatype$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * FMOD_TAGDATATYPE datatype
     * }
     */
    public static int datatype(MemorySegment struct) {
        return struct.get(datatype$LAYOUT, datatype$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * FMOD_TAGDATATYPE datatype
     * }
     */
    public static void datatype(MemorySegment struct, int fieldValue) {
        struct.set(datatype$LAYOUT, datatype$OFFSET, fieldValue);
    }

    private static final AddressLayout name$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("name"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * char *name
     * }
     */
    public static final AddressLayout name$layout() {
        return name$LAYOUT;
    }

    private static final long name$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * char *name
     * }
     */
    public static final long name$offset() {
        return name$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * char *name
     * }
     */
    public static MemorySegment name(MemorySegment struct) {
        return struct.get(name$LAYOUT, name$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * char *name
     * }
     */
    public static void name(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(name$LAYOUT, name$OFFSET, fieldValue);
    }

    private static final AddressLayout data$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("data"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *data
     * }
     */
    public static final AddressLayout data$layout() {
        return data$LAYOUT;
    }

    private static final long data$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *data
     * }
     */
    public static final long data$offset() {
        return data$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *data
     * }
     */
    public static MemorySegment data(MemorySegment struct) {
        return struct.get(data$LAYOUT, data$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *data
     * }
     */
    public static void data(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(data$LAYOUT, data$OFFSET, fieldValue);
    }

    private static final OfInt datalen$LAYOUT = (OfInt)$LAYOUT.select(groupElement("datalen"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * unsigned int datalen
     * }
     */
    public static final OfInt datalen$layout() {
        return datalen$LAYOUT;
    }

    private static final long datalen$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * unsigned int datalen
     * }
     */
    public static final long datalen$offset() {
        return datalen$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * unsigned int datalen
     * }
     */
    public static int datalen(MemorySegment struct) {
        return struct.get(datalen$LAYOUT, datalen$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * unsigned int datalen
     * }
     */
    public static void datalen(MemorySegment struct, int fieldValue) {
        struct.set(datalen$LAYOUT, datalen$OFFSET, fieldValue);
    }

    private static final OfInt updated$LAYOUT = (OfInt)$LAYOUT.select(groupElement("updated"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * FMOD_BOOL updated
     * }
     */
    public static final OfInt updated$layout() {
        return updated$LAYOUT;
    }

    private static final long updated$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * FMOD_BOOL updated
     * }
     */
    public static final long updated$offset() {
        return updated$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * FMOD_BOOL updated
     * }
     */
    public static int updated(MemorySegment struct) {
        return struct.get(updated$LAYOUT, updated$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * FMOD_BOOL updated
     * }
     */
    public static void updated(MemorySegment struct, int fieldValue) {
        struct.set(updated$LAYOUT, updated$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

