// Generated by jextract

package audio.fmod.panama;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct FMOD_DSP_STATE_PAN_FUNCTIONS {
 *     FMOD_DSP_PAN_SUMMONOMATRIX_FUNC summonomatrix;
 *     FMOD_DSP_PAN_SUMSTEREOMATRIX_FUNC sumstereomatrix;
 *     FMOD_DSP_PAN_SUMSURROUNDMATRIX_FUNC sumsurroundmatrix;
 *     FMOD_DSP_PAN_SUMMONOTOSURROUNDMATRIX_FUNC summonotosurroundmatrix;
 *     FMOD_DSP_PAN_SUMSTEREOTOSURROUNDMATRIX_FUNC sumstereotosurroundmatrix;
 *     FMOD_DSP_PAN_GETROLLOFFGAIN_FUNC getrolloffgain;
 * }
 * }
 */
public class FMOD_DSP_STATE_PAN_FUNCTIONS {

    FMOD_DSP_STATE_PAN_FUNCTIONS() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        FmodCore.C_POINTER.withName("summonomatrix"),
        FmodCore.C_POINTER.withName("sumstereomatrix"),
        FmodCore.C_POINTER.withName("sumsurroundmatrix"),
        FmodCore.C_POINTER.withName("summonotosurroundmatrix"),
        FmodCore.C_POINTER.withName("sumstereotosurroundmatrix"),
        FmodCore.C_POINTER.withName("getrolloffgain")
    ).withName("FMOD_DSP_STATE_PAN_FUNCTIONS");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final AddressLayout summonomatrix$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("summonomatrix"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * FMOD_DSP_PAN_SUMMONOMATRIX_FUNC summonomatrix
     * }
     */
    public static final AddressLayout summonomatrix$layout() {
        return summonomatrix$LAYOUT;
    }

    private static final long summonomatrix$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * FMOD_DSP_PAN_SUMMONOMATRIX_FUNC summonomatrix
     * }
     */
    public static final long summonomatrix$offset() {
        return summonomatrix$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * FMOD_DSP_PAN_SUMMONOMATRIX_FUNC summonomatrix
     * }
     */
    public static MemorySegment summonomatrix(MemorySegment struct) {
        return struct.get(summonomatrix$LAYOUT, summonomatrix$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * FMOD_DSP_PAN_SUMMONOMATRIX_FUNC summonomatrix
     * }
     */
    public static void summonomatrix(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(summonomatrix$LAYOUT, summonomatrix$OFFSET, fieldValue);
    }

    private static final AddressLayout sumstereomatrix$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("sumstereomatrix"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * FMOD_DSP_PAN_SUMSTEREOMATRIX_FUNC sumstereomatrix
     * }
     */
    public static final AddressLayout sumstereomatrix$layout() {
        return sumstereomatrix$LAYOUT;
    }

    private static final long sumstereomatrix$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * FMOD_DSP_PAN_SUMSTEREOMATRIX_FUNC sumstereomatrix
     * }
     */
    public static final long sumstereomatrix$offset() {
        return sumstereomatrix$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * FMOD_DSP_PAN_SUMSTEREOMATRIX_FUNC sumstereomatrix
     * }
     */
    public static MemorySegment sumstereomatrix(MemorySegment struct) {
        return struct.get(sumstereomatrix$LAYOUT, sumstereomatrix$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * FMOD_DSP_PAN_SUMSTEREOMATRIX_FUNC sumstereomatrix
     * }
     */
    public static void sumstereomatrix(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(sumstereomatrix$LAYOUT, sumstereomatrix$OFFSET, fieldValue);
    }

    private static final AddressLayout sumsurroundmatrix$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("sumsurroundmatrix"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * FMOD_DSP_PAN_SUMSURROUNDMATRIX_FUNC sumsurroundmatrix
     * }
     */
    public static final AddressLayout sumsurroundmatrix$layout() {
        return sumsurroundmatrix$LAYOUT;
    }

    private static final long sumsurroundmatrix$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * FMOD_DSP_PAN_SUMSURROUNDMATRIX_FUNC sumsurroundmatrix
     * }
     */
    public static final long sumsurroundmatrix$offset() {
        return sumsurroundmatrix$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * FMOD_DSP_PAN_SUMSURROUNDMATRIX_FUNC sumsurroundmatrix
     * }
     */
    public static MemorySegment sumsurroundmatrix(MemorySegment struct) {
        return struct.get(sumsurroundmatrix$LAYOUT, sumsurroundmatrix$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * FMOD_DSP_PAN_SUMSURROUNDMATRIX_FUNC sumsurroundmatrix
     * }
     */
    public static void sumsurroundmatrix(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(sumsurroundmatrix$LAYOUT, sumsurroundmatrix$OFFSET, fieldValue);
    }

    private static final AddressLayout summonotosurroundmatrix$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("summonotosurroundmatrix"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * FMOD_DSP_PAN_SUMMONOTOSURROUNDMATRIX_FUNC summonotosurroundmatrix
     * }
     */
    public static final AddressLayout summonotosurroundmatrix$layout() {
        return summonotosurroundmatrix$LAYOUT;
    }

    private static final long summonotosurroundmatrix$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * FMOD_DSP_PAN_SUMMONOTOSURROUNDMATRIX_FUNC summonotosurroundmatrix
     * }
     */
    public static final long summonotosurroundmatrix$offset() {
        return summonotosurroundmatrix$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * FMOD_DSP_PAN_SUMMONOTOSURROUNDMATRIX_FUNC summonotosurroundmatrix
     * }
     */
    public static MemorySegment summonotosurroundmatrix(MemorySegment struct) {
        return struct.get(summonotosurroundmatrix$LAYOUT, summonotosurroundmatrix$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * FMOD_DSP_PAN_SUMMONOTOSURROUNDMATRIX_FUNC summonotosurroundmatrix
     * }
     */
    public static void summonotosurroundmatrix(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(summonotosurroundmatrix$LAYOUT, summonotosurroundmatrix$OFFSET, fieldValue);
    }

    private static final AddressLayout sumstereotosurroundmatrix$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("sumstereotosurroundmatrix"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * FMOD_DSP_PAN_SUMSTEREOTOSURROUNDMATRIX_FUNC sumstereotosurroundmatrix
     * }
     */
    public static final AddressLayout sumstereotosurroundmatrix$layout() {
        return sumstereotosurroundmatrix$LAYOUT;
    }

    private static final long sumstereotosurroundmatrix$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * FMOD_DSP_PAN_SUMSTEREOTOSURROUNDMATRIX_FUNC sumstereotosurroundmatrix
     * }
     */
    public static final long sumstereotosurroundmatrix$offset() {
        return sumstereotosurroundmatrix$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * FMOD_DSP_PAN_SUMSTEREOTOSURROUNDMATRIX_FUNC sumstereotosurroundmatrix
     * }
     */
    public static MemorySegment sumstereotosurroundmatrix(MemorySegment struct) {
        return struct.get(sumstereotosurroundmatrix$LAYOUT, sumstereotosurroundmatrix$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * FMOD_DSP_PAN_SUMSTEREOTOSURROUNDMATRIX_FUNC sumstereotosurroundmatrix
     * }
     */
    public static void sumstereotosurroundmatrix(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(sumstereotosurroundmatrix$LAYOUT, sumstereotosurroundmatrix$OFFSET, fieldValue);
    }

    private static final AddressLayout getrolloffgain$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("getrolloffgain"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * FMOD_DSP_PAN_GETROLLOFFGAIN_FUNC getrolloffgain
     * }
     */
    public static final AddressLayout getrolloffgain$layout() {
        return getrolloffgain$LAYOUT;
    }

    private static final long getrolloffgain$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * FMOD_DSP_PAN_GETROLLOFFGAIN_FUNC getrolloffgain
     * }
     */
    public static final long getrolloffgain$offset() {
        return getrolloffgain$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * FMOD_DSP_PAN_GETROLLOFFGAIN_FUNC getrolloffgain
     * }
     */
    public static MemorySegment getrolloffgain(MemorySegment struct) {
        return struct.get(getrolloffgain$LAYOUT, getrolloffgain$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * FMOD_DSP_PAN_GETROLLOFFGAIN_FUNC getrolloffgain
     * }
     */
    public static void getrolloffgain(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(getrolloffgain$LAYOUT, getrolloffgain$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

