// Generated by jextract

package audio.fmod.panama;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct FMOD_DSP_PARAMETER_DESC_INT {
 *     int min;
 *     int max;
 *     int defaultval;
 *     FMOD_BOOL goestoinf;
 *     const char *const *valuenames;
 * }
 * }
 */
public class FMOD_DSP_PARAMETER_DESC_INT {

    FMOD_DSP_PARAMETER_DESC_INT() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        FmodCore.C_INT.withName("min"),
        FmodCore.C_INT.withName("max"),
        FmodCore.C_INT.withName("defaultval"),
        FmodCore.C_INT.withName("goestoinf"),
        FmodCore.C_POINTER.withName("valuenames")
    ).withName("FMOD_DSP_PARAMETER_DESC_INT");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt min$LAYOUT = (OfInt)$LAYOUT.select(groupElement("min"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int min
     * }
     */
    public static final OfInt min$layout() {
        return min$LAYOUT;
    }

    private static final long min$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int min
     * }
     */
    public static final long min$offset() {
        return min$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int min
     * }
     */
    public static int min(MemorySegment struct) {
        return struct.get(min$LAYOUT, min$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int min
     * }
     */
    public static void min(MemorySegment struct, int fieldValue) {
        struct.set(min$LAYOUT, min$OFFSET, fieldValue);
    }

    private static final OfInt max$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int max
     * }
     */
    public static final OfInt max$layout() {
        return max$LAYOUT;
    }

    private static final long max$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int max
     * }
     */
    public static final long max$offset() {
        return max$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int max
     * }
     */
    public static int max(MemorySegment struct) {
        return struct.get(max$LAYOUT, max$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int max
     * }
     */
    public static void max(MemorySegment struct, int fieldValue) {
        struct.set(max$LAYOUT, max$OFFSET, fieldValue);
    }

    private static final OfInt defaultval$LAYOUT = (OfInt)$LAYOUT.select(groupElement("defaultval"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int defaultval
     * }
     */
    public static final OfInt defaultval$layout() {
        return defaultval$LAYOUT;
    }

    private static final long defaultval$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int defaultval
     * }
     */
    public static final long defaultval$offset() {
        return defaultval$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int defaultval
     * }
     */
    public static int defaultval(MemorySegment struct) {
        return struct.get(defaultval$LAYOUT, defaultval$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int defaultval
     * }
     */
    public static void defaultval(MemorySegment struct, int fieldValue) {
        struct.set(defaultval$LAYOUT, defaultval$OFFSET, fieldValue);
    }

    private static final OfInt goestoinf$LAYOUT = (OfInt)$LAYOUT.select(groupElement("goestoinf"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * FMOD_BOOL goestoinf
     * }
     */
    public static final OfInt goestoinf$layout() {
        return goestoinf$LAYOUT;
    }

    private static final long goestoinf$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * FMOD_BOOL goestoinf
     * }
     */
    public static final long goestoinf$offset() {
        return goestoinf$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * FMOD_BOOL goestoinf
     * }
     */
    public static int goestoinf(MemorySegment struct) {
        return struct.get(goestoinf$LAYOUT, goestoinf$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * FMOD_BOOL goestoinf
     * }
     */
    public static void goestoinf(MemorySegment struct, int fieldValue) {
        struct.set(goestoinf$LAYOUT, goestoinf$OFFSET, fieldValue);
    }

    private static final AddressLayout valuenames$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("valuenames"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const char *const *valuenames
     * }
     */
    public static final AddressLayout valuenames$layout() {
        return valuenames$LAYOUT;
    }

    private static final long valuenames$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const char *const *valuenames
     * }
     */
    public static final long valuenames$offset() {
        return valuenames$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const char *const *valuenames
     * }
     */
    public static MemorySegment valuenames(MemorySegment struct) {
        return struct.get(valuenames$LAYOUT, valuenames$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const char *const *valuenames
     * }
     */
    public static void valuenames(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(valuenames$LAYOUT, valuenames$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

